spring-ws-security/src/test/resources/org/springframework/ws/soap/security/wss4j2/signed-soap.xml

<?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header>
<wsse:Security xmlns:wsse="https://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" SOAP-ENV:mustUnderstand="1"><ds:Signature xmlns:ds="https://www.w3.org/2000/09/xmldsig#" Id="Signature-13673945">
<ds:SignedInfo xmlns:ds="https://www.w3.org/2000/09/xmldsig#">

<ds:CanonicalizationMethod Algorithm="https://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="https://www.w3.org/2000/09/xmldsig#"/>
<ds:SignatureMethod Algorithm="https://www.w3.org/2000/09/xmldsig#rsa-sha1" xmlns:ds="https://www.w3.org/2000/09/xmldsig#"/>
<ds:Reference URI="#id-32487478" xmlns:ds="https://www.w3.org/2000/09/xmldsig#">
<ds:Transforms xmlns:ds="https://www.w3.org/2000/09/xmldsig#">
<ds:Transform Algorithm="https://www.w3.org/2001/10/xml-exc-c14n#" xmlns:ds="https://www.w3.org/2000/09/xmldsig#"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="https://www.w3.org/2000/09/xmldsig#sha1" xmlns:ds="https://www.w3.org/2000/09/xmldsig#"/>
<ds:DigestValue xmlns:ds="https://www.w3.org/2000/09/xmldsig#">70oDCsbAmt7qauS7FmUvB7oVDfM=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue xmlns:ds="https://www.w3.org/2000/09/xmldsig#">
lUrzlFJIz4SRTf+qP9zPZr0s9tN+Suu+XJ2iwVwSMoJIfw+1YQSnWrQZD7EctacGN8iAHqP5g/LK
mXtOw0Ar03uwjoeUBqmchcIjWZjyYYmvtTDF9VA70z07C4zp7FYAP7GLKVCb4hmFn81mHLhWYlo7
2bQEpkIOjaC5IBoFiLI=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-30426707" xmlns:ds="https://www.w3.org/2000/09/xmldsig#">
<wsse:SecurityTokenReference xmlns:wsu="https://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STRId-28145575" xmlns:wsse="https://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:X509Data xmlns:ds="https://www.w3.org/2000/09/xmldsig#">
<ds:X509IssuerSerial xmlns:ds="https://www.w3.org/2000/09/xmldsig#">
<ds:X509IssuerName xmlns:ds="https://www.w3.org/2000/09/xmldsig#">CN=Unknown,OU=Unknown,O=Unknown,L=Unknown,ST=Unknown,C=Unknown</ds:X509IssuerName>

<ds:X509SerialNumber xmlns:ds="https://www.w3.org/2000/09/xmldsig#">1204234455</ds:X509SerialNumber>
</ds:X509IssuerSerial>
</ds:X509Data></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature></wsse:Security></SOAP-ENV:Header><SOAP-ENV:Body xmlns:wsu="https://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-32487478"><tns:echoRequest xmlns:tns="http://www.springframework.org/spring-ws/samples/echo">Hello</tns:echoRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
